console.log("1. Вёрстка валидная +10");
console.log(
  "для проверки валидности вёрстки используйте сервис https://validator.w3.org/"
);
console.log(
  'валидной вёрстке соответствует надпись "Document checking completed. No errors or warnings to show."'
);
console.log("В таком случае баллы за пункт требований выставляем полностью.");
console.log(
  "если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований"
);
console.log("2. Вёрстка семантическая +20");
console.log(
  "В коде странице присутствуют следующие элементы (указано минимальное количество, может быть больше):"
);
console.log("<header>, <main>, <footer> +3");
console.log("пять элементов <section> (по количеству секций) +3");
console.log("только один заголовок <h1> +3");
console.log(
  "четыре заголовка <h2> (количество секций минус одна, у которой заголовок <h1>) +3"
);
console.log("один элемент <nav> (панель навигации) +3");
console.log("два списка ul > li > a (панель навигации, ссылки на соцсети) +3");
console.log("пять кнопок <button> +2");
console.log("3. Вёрстка соответствует макету +48");
console.log("блок <header> +6");
console.log("секция welcome +7");
console.log("секция about +7");
console.log("секция service +7");
console.log("секция prices +7");
console.log("секция contacts +7");
console.log("блок <footer> +7");
console.log("4. Требования к css + 12");
console.log("для построения сетки используются флексы или гриды +2");
console.log(
  "при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2"
);
console.log("фоновый цвет тянется на всю ширину страницы +2");
console.log(
  "иконки добавлены в формате .svg. SVG может быть добавлен любым способом."
);
console.log("Обращаем внимание на формат, а не на способ добавления +2");
console.log("изображения добавлены в формате .jpg или .png +2");
console.log("есть favicon +2");
console.log("5. Интерактивность, реализуемая через css +20");
console.log("плавная прокрутка по якорям +5");
console.log(
  "cсылки в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса https://rs.school/js-stage0/ +5"
);
console.log(
  "интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer,"
);
console.log(
  "но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили."
);
console.log(
  "Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +5"
);
console.log(
  "обязательное требование к интерактивности:\n плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5"
);
console.log(
  "Я надеюсь, что все сделала правильно, но PerfectPixel возможно покажет иное \n 100 / 100"
);
